virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/shdwc.h
#define SHDW_WUIR_WKUPT7_LOW                  (SHDW_WUIR_WKUPT7_LOW_Val << SHDW_WUIR_WKUPT7_Pos)   /**< (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT7_HIGH                 (SHDW_WUIR_WKUPT7_HIGH_Val << SHDW_WUIR_WKUPT7_Pos)  /**< (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT8_Pos                  _U_(24)                                              /**< (SHDW_WUIR) Wake-up 8 Input Type Position */
#define SHDW_WUIR_WKUPT8_Msk                  (_U_(0x1) << SHDW_WUIR_WKUPT8_Pos)                   /**< (SHDW_WUIR) Wake-up 8 Input Type Mask */
#define SHDW_WUIR_WKUPT8(value)               (SHDW_WUIR_WKUPT8_Msk & ((value) << SHDW_WUIR_WKUPT8_Pos))
#define   SHDW_WUIR_WKUPT8_LOW_Val            _U_(0x0)                                             /**< (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT8_HIGH_Val           _U_(0x1)                                             /**< (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT8_LOW                  (SHDW_WUIR_WKUPT8_LOW_Val << SHDW_WUIR_WKUPT8_Pos)   /**< (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT8_HIGH                 (SHDW_WUIR_WKUPT8_HIGH_Val << SHDW_WUIR_WKUPT8_Pos)  /**< (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT9_Pos                  _U_(25)                                              /**< (SHDW_WUIR) Wake-up 9 Input Type Position */
#define SHDW_WUIR_WKUPT9_Msk                  (_U_(0x1) << SHDW_WUIR_WKUPT9_Pos)                   /**< (SHDW_WUIR) Wake-up 9 Input Type Mask */
#define SHDW_WUIR_WKUPT9(value)               (SHDW_WUIR_WKUPT9_Msk & ((value) << SHDW_WUIR_WKUPT9_Pos))
#define   SHDW_WUIR_WKUPT9_LOW_Val            _U_(0x0)                                             /**< (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT9_HIGH_Val           _U_(0x1)                                             /**< (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT9_LOW                  (SHDW_WUIR_WKUPT9_LOW_Val << SHDW_WUIR_WKUPT9_Pos)   /**< (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT9_HIGH                 (SHDW_WUIR_WKUPT9_HIGH_Val << SHDW_WUIR_WKUPT9_Pos)  /**< (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_Msk                         _U_(0x03FF03FF)                                      /**< (SHDW_WUIR) Register Mask  */

#define SHDW_WUIR_WKUPEN_Pos                  _U_(0)                                               /**< (SHDW_WUIR Position) Wake-up x Input Enable */
#define SHDW_WUIR_WKUPEN_Msk                  (_U_(0x3FF) << SHDW_WUIR_WKUPEN_Pos)                 /**< (SHDW_WUIR Mask) WKUPEN */
#define SHDW_WUIR_WKUPEN(value)               (SHDW_WUIR_WKUPEN_Msk & ((value) << SHDW_WUIR_WKUPEN_Pos)) 
#define SHDW_WUIR_WKUPT_Pos                   _U_(16)                                              /**< (SHDW_WUIR Position) Wake-up 9 Input Type */
#define SHDW_WUIR_WKUPT_Msk                   (_U_(0x3FF) << SHDW_WUIR_WKUPT_Pos)                  /**< (SHDW_WUIR Mask) WKUPT */
#define SHDW_WUIR_WKUPT(value)                (SHDW_WUIR_WKUPT_Msk & ((value) << SHDW_WUIR_WKUPT_Pos)) 

/** \brief SHDWC register offsets definitions */
#define SHDW_CR_REG_OFST               (0x00)              /**< (SHDW_CR) Shutdown Control Register Offset */
#define SHDW_MR_REG_OFST               (0x04)              /**< (SHDW_MR) Shutdown Mode Register Offset */
#define SHDW_SR_REG_OFST               (0x08)              /**< (SHDW_SR) Shutdown Status Register Offset */
#define SHDW_WUIR_REG_OFST             (0x0C)              /**< (SHDW_WUIR) Shutdown Wake-up Inputs Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SHDWC register API structure */
typedef struct
{
  __O   uint32_t                       SHDW_CR;            /**< Offset: 0x00 ( /W  32) Shutdown Control Register */
  __IO  uint32_t                       SHDW_MR;            /**< Offset: 0x04 (R/W  32) Shutdown Mode Register */
  __I   uint32_t                       SHDW_SR;            /**< Offset: 0x08 (R/   32) Shutdown Status Register */
  __IO  uint32_t                       SHDW_WUIR;          /**< Offset: 0x0C (R/W  32) Shutdown Wake-up Inputs Register */
} shdwc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_SHDWC_COMPONENT_H_ */
